; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos) 
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key) 
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-6-6-4-6-6)
    (:domain grid)
    (:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos3-5 pos4-0 pos4-1 pos4-2 pos4-3 pos4-4 pos4-5 pos5-0 pos5-1 pos5-2 pos5-3 pos5-4 pos5-5
    shape0 shape1 shape2 shape3
    key0 key1 key2 key3 key4 key5
    )

    (:init
       (arm-empty)

       (place pos0-0)
       (place pos0-1)
       (place pos0-2)
       (place pos0-3)
       (place pos0-4)
       (place pos0-5)
       (place pos1-0)
       (place pos1-1)
       (place pos1-2)
       (place pos1-3)
       (place pos1-4)
       (place pos1-5)
       (place pos2-0)
       (place pos2-1)
       (place pos2-2)
       (place pos2-3)
       (place pos2-4)
       (place pos2-5)
       (place pos3-0)
       (place pos3-1)
       (place pos3-2)
       (place pos3-3)
       (place pos3-4)
       (place pos3-5)
       (place pos4-0)
       (place pos4-1)
       (place pos4-2)
       (place pos4-3)
       (place pos4-4)
       (place pos4-5)
       (place pos5-0)
       (place pos5-1)
       (place pos5-2)
       (place pos5-3)
       (place pos5-4)
       (place pos5-5)
       (shape shape0)
       (shape shape1)
       (shape shape2)
       (shape shape3)
       (key key0)
       (key key1)
       (key key2)
       (key key3)
       (key key4)
       (key key5)

       (conn pos0-0 pos1-0)
       (conn pos0-0 pos0-1)
       (conn pos0-1 pos1-1)
       (conn pos0-1 pos0-2)
       (conn pos0-1 pos0-0)
       (conn pos0-2 pos1-2)
       (conn pos0-2 pos0-3)
       (conn pos0-2 pos0-1)
       (conn pos0-3 pos1-3)
       (conn pos0-3 pos0-4)
       (conn pos0-3 pos0-2)
       (conn pos0-4 pos1-4)
       (conn pos0-4 pos0-5)
       (conn pos0-4 pos0-3)
       (conn pos0-5 pos1-5)
       (conn pos0-5 pos0-4)
       (conn pos1-0 pos2-0)
       (conn pos1-0 pos1-1)
       (conn pos1-0 pos0-0)
       (conn pos1-1 pos2-1)
       (conn pos1-1 pos1-2)
       (conn pos1-1 pos0-1)
       (conn pos1-1 pos1-0)
       (conn pos1-2 pos2-2)
       (conn pos1-2 pos1-3)
       (conn pos1-2 pos0-2)
       (conn pos1-2 pos1-1)
       (conn pos1-3 pos2-3)
       (conn pos1-3 pos1-4)
       (conn pos1-3 pos0-3)
       (conn pos1-3 pos1-2)
       (conn pos1-4 pos2-4)
       (conn pos1-4 pos1-5)
       (conn pos1-4 pos0-4)
       (conn pos1-4 pos1-3)
       (conn pos1-5 pos2-5)
       (conn pos1-5 pos0-5)
       (conn pos1-5 pos1-4)
       (conn pos2-0 pos3-0)
       (conn pos2-0 pos2-1)
       (conn pos2-0 pos1-0)
       (conn pos2-1 pos3-1)
       (conn pos2-1 pos2-2)
       (conn pos2-1 pos1-1)
       (conn pos2-1 pos2-0)
       (conn pos2-2 pos3-2)
       (conn pos2-2 pos2-3)
       (conn pos2-2 pos1-2)
       (conn pos2-2 pos2-1)
       (conn pos2-3 pos3-3)
       (conn pos2-3 pos2-4)
       (conn pos2-3 pos1-3)
       (conn pos2-3 pos2-2)
       (conn pos2-4 pos3-4)
       (conn pos2-4 pos2-5)
       (conn pos2-4 pos1-4)
       (conn pos2-4 pos2-3)
       (conn pos2-5 pos3-5)
       (conn pos2-5 pos1-5)
       (conn pos2-5 pos2-4)
       (conn pos3-0 pos4-0)
       (conn pos3-0 pos3-1)
       (conn pos3-0 pos2-0)
       (conn pos3-1 pos4-1)
       (conn pos3-1 pos3-2)
       (conn pos3-1 pos2-1)
       (conn pos3-1 pos3-0)
       (conn pos3-2 pos4-2)
       (conn pos3-2 pos3-3)
       (conn pos3-2 pos2-2)
       (conn pos3-2 pos3-1)
       (conn pos3-3 pos4-3)
       (conn pos3-3 pos3-4)
       (conn pos3-3 pos2-3)
       (conn pos3-3 pos3-2)
       (conn pos3-4 pos4-4)
       (conn pos3-4 pos3-5)
       (conn pos3-4 pos2-4)
       (conn pos3-4 pos3-3)
       (conn pos3-5 pos4-5)
       (conn pos3-5 pos2-5)
       (conn pos3-5 pos3-4)
       (conn pos4-0 pos5-0)
       (conn pos4-0 pos4-1)
       (conn pos4-0 pos3-0)
       (conn pos4-1 pos5-1)
       (conn pos4-1 pos4-2)
       (conn pos4-1 pos3-1)
       (conn pos4-1 pos4-0)
       (conn pos4-2 pos5-2)
       (conn pos4-2 pos4-3)
       (conn pos4-2 pos3-2)
       (conn pos4-2 pos4-1)
       (conn pos4-3 pos5-3)
       (conn pos4-3 pos4-4)
       (conn pos4-3 pos3-3)
       (conn pos4-3 pos4-2)
       (conn pos4-4 pos5-4)
       (conn pos4-4 pos4-5)
       (conn pos4-4 pos3-4)
       (conn pos4-4 pos4-3)
       (conn pos4-5 pos5-5)
       (conn pos4-5 pos3-5)
       (conn pos4-5 pos4-4)
       (conn pos5-0 pos5-1)
       (conn pos5-0 pos4-0)
       (conn pos5-1 pos5-2)
       (conn pos5-1 pos4-1)
       (conn pos5-1 pos5-0)
       (conn pos5-2 pos5-3)
       (conn pos5-2 pos4-2)
       (conn pos5-2 pos5-1)
       (conn pos5-3 pos5-4)
       (conn pos5-3 pos4-3)
       (conn pos5-3 pos5-2)
       (conn pos5-4 pos5-5)
       (conn pos5-4 pos4-4)
       (conn pos5-4 pos5-3)
       (conn pos5-5 pos4-5)
       (conn pos5-5 pos5-4)
       (locked pos1-1)
       (locked pos1-0)
       (locked pos4-1)
       (locked pos2-1)
       (locked pos0-3)
       (locked pos4-3)
       (lock-shape  pos1-1 shape0)
       (lock-shape  pos1-0 shape1)
       (lock-shape  pos4-1 shape2)
       (lock-shape  pos2-1 shape3)
       (lock-shape  pos0-3 shape3)
       (lock-shape  pos4-3 shape2)
       (open pos0-0)
       (open pos0-1)
       (open pos0-2)
       (open pos0-4)
       (open pos0-5)
       (open pos1-2)
       (open pos1-3)
       (open pos1-4)
       (open pos1-5)
       (open pos2-0)
       (open pos2-2)
       (open pos2-3)
       (open pos2-4)
       (open pos2-5)
       (open pos3-0)
       (open pos3-1)
       (open pos3-2)
       (open pos3-3)
       (open pos3-4)
       (open pos3-5)
       (open pos4-0)
       (open pos4-2)
       (open pos4-4)
       (open pos4-5)
       (open pos5-0)
       (open pos5-1)
       (open pos5-2)
       (open pos5-3)
       (open pos5-4)
       (open pos5-5)

       (key-shape  key0 shape0)
       (key-shape  key1 shape1)
       (key-shape  key2 shape2)
       (key-shape  key3 shape3)
       (key-shape  key4 shape3)
       (key-shape  key5 shape1)
       (at key0 pos2-2)
       (at key1 pos0-4)
       (at key2 pos5-2)
       (at key3 pos5-0)
       (at key4 pos4-1)
       (at key5 pos1-5)
       (at-robot pos3-3)
    )

    (:goal (and
       (at key0 pos1-2)
       (at key2 pos0-5)
       (at key5 pos4-2)
    )))

; plan
1. (move pos3-3 pos3-2)
   deleted: (at-robot pos3-3)
   added: (at-robot pos3-2)
   goals met: 0 of 3
2. (move pos3-2 pos2-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos2-2)
   goals met: 0 of 3
3. (pickup pos2-2 key0)
   deleted: (at key0 pos2-2) (arm-empty)
   added: (holding key0)
   goals met: 0 of 3
4. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 0 of 3
5. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 0 of 3
6. (move pos1-3 pos1-4)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-4)
   goals met: 0 of 3
7. (move pos1-4 pos1-5)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-5)
   goals met: 0 of 3
8. (move pos1-5 pos0-5)
   deleted: (at-robot pos1-5)
   added: (at-robot pos0-5)
   goals met: 0 of 3
9. (putdown pos0-5 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos0-5)
   goals met: 0 of 3
10. (move pos0-5 pos1-5)
   deleted: (at-robot pos0-5)
   added: (at-robot pos1-5)
   goals met: 0 of 3
11. (pickup pos1-5 key5)
   deleted: (at key5 pos1-5) (arm-empty)
   added: (holding key5)
   goals met: 0 of 3
12. (move pos1-5 pos1-4)
   deleted: (at-robot pos1-5)
   added: (at-robot pos1-4)
   goals met: 0 of 3
13. (move pos1-4 pos1-3)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-3)
   goals met: 0 of 3
14. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 0 of 3
15. (move pos1-2 pos2-2)
   deleted: (at-robot pos1-2)
   added: (at-robot pos2-2)
   goals met: 0 of 3
16. (move pos2-2 pos3-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos3-2)
   goals met: 0 of 3
17. (move pos3-2 pos4-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos4-2)
   goals met: 0 of 3
18. (putdown pos4-2 key5)
   deleted: (holding key5)
   added: (arm-empty) (at key5 pos4-2)
   goals met: 1 of 3
19. (move pos4-2 pos5-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos5-2)
   goals met: 1 of 3
20. (pickup pos5-2 key2)
   deleted: (at key2 pos5-2) (arm-empty)
   added: (holding key2)
   goals met: 1 of 3
21. (move pos5-2 pos4-2)
   deleted: (at-robot pos5-2)
   added: (at-robot pos4-2)
   goals met: 1 of 3
22. (move pos4-2 pos3-2)
   deleted: (at-robot pos4-2)
   added: (at-robot pos3-2)
   goals met: 1 of 3
23. (move pos3-2 pos2-2)
   deleted: (at-robot pos3-2)
   added: (at-robot pos2-2)
   goals met: 1 of 3
24. (move pos2-2 pos1-2)
   deleted: (at-robot pos2-2)
   added: (at-robot pos1-2)
   goals met: 1 of 3
25. (move pos1-2 pos1-3)
   deleted: (at-robot pos1-2)
   added: (at-robot pos1-3)
   goals met: 1 of 3
26. (move pos1-3 pos1-4)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-4)
   goals met: 1 of 3
27. (move pos1-4 pos0-4)
   deleted: (at-robot pos1-4)
   added: (at-robot pos0-4)
   goals met: 1 of 3
28. (move pos0-4 pos0-5)
   deleted: (at-robot pos0-4)
   added: (at-robot pos0-5)
   goals met: 1 of 3
29. (pickup-and-loose pos0-5 key0 key2)
   deleted: (holding key2) (at key0 pos0-5)
   added: (holding key0) (at key2 pos0-5)
   goals met: 2 of 3
30. (move pos0-5 pos0-4)
   deleted: (at-robot pos0-5)
   added: (at-robot pos0-4)
   goals met: 2 of 3
31. (move pos0-4 pos1-4)
   deleted: (at-robot pos0-4)
   added: (at-robot pos1-4)
   goals met: 2 of 3
32. (move pos1-4 pos1-3)
   deleted: (at-robot pos1-4)
   added: (at-robot pos1-3)
   goals met: 2 of 3
33. (move pos1-3 pos1-2)
   deleted: (at-robot pos1-3)
   added: (at-robot pos1-2)
   goals met: 2 of 3
34. (putdown pos1-2 key0)
   deleted: (holding key0)
   added: (arm-empty) (at key0 pos1-2)
   goals met: 3 of 3
